package algorithms5;

import java.util.Scanner;

/**
 * Раунд плей-офф между двумя командами состоит из двух матчей. Каждая команда проводит по одному матчу «дома» и
 * «в гостях». Выигрывает команда, забившая большее число мячей. Если же число забитых мячей совпадает,
 * выигрывает команда, забившая больше мячей «в гостях». Если и это число мячей совпадает, матч переходит в
 * дополнительный тайм или серию пенальти.
 * Вам дан счёт первого матча, а также счёт текущей игры (которая ещё не завершилась). Помогите комментатору сообщить,
 * сколько голов необходимо забить первой команде, чтобы победить, не переводя игру в дополнительное время.
 * Формат ввода
 * В первой строке записан счёт первого мачта в формате G1:G2, где G1 — число мячей, забитых первой командой,
 * а G2 — число мячей, забитых второй командой.
 * Во второй строке записан счёт второго (текущего) матча в аналогичном формате.
 * Все числа в записи счёта не превышают 5.
 * В третьей строке записано число 1, если первую игру первая команда провела «дома», или 2, если «в гостях».
 * Формат вывода
 * Выведите единственное целое число "— необходимое количество мячей.
 *
 * Пример 1
 * Ввод
 * 0:0
 * 0:0
 * 1
 * Вывод
 * 1
 *
 * Пример 2
 * Ввод
 *  0:2
 *  0:3
 *  1
 * Вывод
 * 5

 * Пример 3
 * Ввод
 * 0:2
 * 0:3
 * 2
 * Вывод
 * 6
 */
public class Task1B {
    public static void main(String[] args) {
        Scanner s = new Scanner(System.in);
        int  g = 3333, g1, g2, g3, g4, homeOrNo;
        String home, guest;
        home = s.nextLine();
        guest = s.nextLine();
        homeOrNo = s.nextInt();
        g1 = Integer.parseInt(String.valueOf(home.charAt(0)));
        g2 = Integer.parseInt(String.valueOf(home.charAt(2)));
        g3 = Integer.parseInt(String.valueOf(guest.charAt(0)));
        g4 = Integer.parseInt(String.valueOf(guest.charAt(2)));

        if ((g1 + g3) > (g2 + g4)){
            g = 0;
        }
        if ((g1 + g3) == (g2 + g4)){
            if (homeOrNo == 1) {
                if (g3 > g2){
                    g = 0;
                }
                else  {
                    g = 1;
                }
            } else {
                if (g1 > g4){
                    g = 0;
                }else {
                    g = 1;
                }
            }
        }
        if ((g1 + g3) < (g2 + g4)){
            int gg = (g2 + g4) - (g1 + g3);
            int g33 = g3 + gg;
            if (homeOrNo == 1){
                if (g33 <= g2){
                    g = gg + 1;
                }else {
                    g = gg;
                }
            }else {
                if (g1 <= g4){
                    g = gg + 1;
                }else {
                    g = gg;
                }
            }
        }
        System.out.println(g);
    }
}
